lisir233/ESP-Iris/examples/esp_iris_display_input/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s31"
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESPTOOLPY_FLASHSIZE_2MB=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# One RGB565 scanline is 960 bytes. The default 3840-byte Iris media buffer
# can carry four scanlines per protocol chunk.
CONFIG_ESP_IRIS_TRANSPORT_USB=y
CONFIG_ESP_IRIS_MEDIA_LATEST_BYTES=3840
CONFIG_ESP_IRIS_TASK_STACK_SIZE=3328
CONFIG_TINYUSB_CDC_RX_BUFSIZE=8192
CONFIG_TINYUSB_CDC_TX_BUFSIZE=8192
CONFIG_TINYUSB_CDC_EP_BUFSIZE=8192
